export default {
  locale: {
    en: 'English',
    km: 'Khmer'
  },

  theme: {
    light: 'ភ្លឺ',
    dark: 'ងងឹត',
    system: 'ប្រព័ន្ធ'
  },

  signInToYourAccount: 'ចូលគណនីរបស់អ្នក',
  search: 'ស្វែងរក',
  loginInfo: 'ព័ត៌មានចូលអ្នកប្រើប្រាស់',
  username: 'ឈ្មោះ​អ្នកប្រើប្រាស់',
  password: 'ពាក្យសម្ងាត់',
  confirmPassword: 'បញ្ជាក់ពាក្យសម្ងាត់',
  personalInfo: 'ព័ត៌មាន​ផ្ទាល់ខ្លួន',
  firstName: 'នាមខ្លួន',
  lastName: 'នាមត្រកូល',
  firstNameKh: 'នាមខ្លួន (ភាសាខ្មែរ)',
  lastNameKh: 'នាមត្រកូល (ភាសាខ្មែរ)',
  fullName: 'ឈ្មោះពេញ',
  fullNameKh: 'ឈ្មោះពេញ (ភាសាខ្មែរ)',
  email: 'អ៊ីមែល',
  phoneNumber: 'លេខទូរសព្ទ',
  status: 'ស្ថានភាព',
  actions: 'សកម្មភាព',
  description: 'ការពិពណ៌នា',
  permissions: 'ការអនុញ្ញាត',

  signIn: 'ចូល',
  forgotPassword: 'ភ្លេច​លេខសំងាត់​?',
  forgotYourPassword: 'ភ្លេចពាក្យសម្ងាត់របស់អ្នក?',
  submit: 'ដាក់ស្នើ',
  save: 'រក្សាទុក',
  saveAsDraft: 'រក្សាទុកជាសេចក្តីព្រាង',
  cancel: 'បោះបង់',
  update: 'ធ្វើបច្ចុប្បន្នភាព',
  back: 'ត្រឡប់ក្រោយ',

  create: 'បង្កើត',
  edit: 'កែសម្រួល',
  details: 'ព័ត៌មានលម្អិត',
  active: 'សកម្ម',
  deactivated: 'អសកម្ម',
  viewDetails: 'មើលព័ត៌មានលម្អិត',

  login: {
    username: 'បញ្ចូលឈ្មោះអ្នកប្រើប្រាស់របស់អ្នក',
    password: 'បញ្ចូលតួអក្សរ {passwordLength} ឬច្រើនជាងនេះ។'
  },

  dashboard: 'ផ្ទាំងគ្រប់គ្រង',
  userManagement: 'ការគ្រប់គ្រងអ្នកប្រើប្រាស់',
  user: {
    label: 'អ្នកប្រើប្រាស់',
    description:
      'ការ​គ្រប់​គ្រង​អ្នក​ប្រើ​រួម​មាន​មុខងារ​ដូច​ជា​ការ​ផ្ទៀងផ្ទាត់​អ្នក​ប្រើ​ ការ​អនុញ្ញាត​ ការ​គ្រប់​គ្រង​ទម្រង់​ ការ​គ្រប់​គ្រង​ពាក្យ​សម្ងាត់​ ការ​តាមដាន​សកម្មភាព​ ការ​បិទ​គណនី​/ការ​ផ្អាក​ និង​ការ​ទំនាក់ទំនង​អ្នក​ប្រើ​។',
    list: 'បញ្ជីអ្នកប្រើប្រាស់',
    category: 'ប្រភេទអ្នកប្រើប្រាស់',
    addNew: 'បន្ថែមអ្នកប្រើប្រាស់ថ្មី',
    edit: 'កែសម្រួលអ្នកប្រើប្រាស់'
  },

  role: {
    label: 'តួនាទី',
    list: 'បញ្ជីតួនាទី',
    info: 'ព័ត៌មានអំពីតួនាទី',
    name: 'ឈ្មោះតួនាទី',
    nameEn: 'ឈ្មោះតួនាទី',
    nameKh: 'ឈ្មោះតួនាទី (ភាសាខ្មែរ)',
    roleType: 'ប្រភេទតួនាទី',
    addNew: 'បន្ថែមតួនាទី',
    edit: 'កែសម្រួលតួនាទី'
  }
};
