export default {
  dashboard: {
    title: "ផ្ទាំងគ្រប់គ្រង",
  },
  signInToYourAccount: "ចូលគណនីរបស់អ្នក",
  username: "ឈ្មោះ​អ្នកប្រើប្រាស់",
  password: "ពាក្យសម្ងាត់",

  userManagement: {
    title: "ការគ្រប់គ្រងអ្នកប្រើប្រាស់",
    user: {
      title: "អ្នកប្រើប្រាស់",
      list: "បញ្ជីអ្នកប្រើប្រាស់",
      info: "ព័ត៌មានអ្នកប្រើប្រាស់",
      category: "ប្រភេទអ្នកប្រើប្រាស់",
      loginInfo: "ព័ត៌មានចូលអ្នកប្រើប្រាស់",
    },

    role: {
      title: "តួនាទី",
      list: "បញ្ជីតួនាទី",
      info: "ព័ត៌មានអំពីតួនាទី",
      name: "ឈ្មោះតួនាទី",
      nameEn: "ឈ្មោះតួនាទីជាភាសាអង់គ្លេស",
      nameKh: "ឈ្មោះតួនាទីជាភាសាខ្មែរ",
      type: "ប្រភេទតួនាទី",
    },
  },
};