export default {
  locale: {
    en: "English",
    km: "Khmer"
  },

  theme: {
    light: 'ភ្លឺ',
    dark: 'ងងឹត',
    system: 'ប្រព័ន្ធ'
  },

  dashboard: {
    title: 'ផ្ទាំងគ្រប់គ្រង'
  },

  signInToYourAccount: 'ចូលគណនីរបស់អ្នក',
  search: "ស្វែងរក",
  username: 'ឈ្មោះ​អ្នកប្រើប្រាស់',
  password: 'ពាក្យសម្ងាត់',
  fullNameEn: 'ឈ្មោះពេញ (ជាភាសាអង់គ្លេស)',
  fullNameKh: 'ឈ្មោះពេញ (ជាភាសាខ្មែរ)',
  email: "អ៊ីមែល",
  status: "ស្ថានភាព",
  actions: "សកម្មភាព",

  userManagement: {
    title: 'ការគ្រប់គ្រងអ្នកប្រើប្រាស់',
    user: {
      title: 'អ្នកប្រើប្រាស់',
      description: "ការ​គ្រប់​គ្រង​អ្នក​ប្រើ​រួម​មាន​មុខងារ​ដូច​ជា​ការ​ផ្ទៀងផ្ទាត់​អ្នក​ប្រើ​ ការ​អនុញ្ញាត​ ការ​គ្រប់​គ្រង​ទម្រង់​ ការ​គ្រប់​គ្រង​ពាក្យ​សម្ងាត់​ ការ​តាមដាន​សកម្មភាព​ ការ​បិទ​គណនី​/ការ​ផ្អាក​ និង​ការ​ទំនាក់ទំនង​អ្នក​ប្រើ​។",
      list: 'បញ្ជីអ្នកប្រើប្រាស់',
      info: 'ព័ត៌មានអ្នកប្រើប្រាស់',
      category: 'ប្រភេទអ្នកប្រើប្រាស់',
      loginInfo: 'ព័ត៌មានចូលអ្នកប្រើប្រាស់'
    },

    role: {
      title: 'តួនាទី',
      list: 'បញ្ជីតួនាទី',
      info: 'ព័ត៌មានអំពីតួនាទី',
      name: 'ឈ្មោះតួនាទី',
      nameEn: 'ឈ្មោះតួនាទីជាភាសាអង់គ្លេស',
      nameKh: 'ឈ្មោះតួនាទីជាភាសាខ្មែរ',
      type: 'ប្រភេទតួនាទី'
    }
  }
};
